LiteOS/LiteOS/platform/MM32L073PF/include/MM32L073PF.h
  __IO uint32_t IC_FS_SPKLEN;
  __IO uint32_t IC_HS_SPKLEN;
  
  __IO uint16_t IC_CLR_RESTART_DET;
  uint16_t  RESERVED28;
  __IO uint32_t IC_COMP_PARAM_1;
  __IO uint32_t IC_COMP_VERSION;
  __IO uint32_t IC_COMP_TYPE;
  
} I2C_TypeDef;

/** 
* @brief Independent WATCHDOG
*/

typedef struct
{
  __IO uint32_t KR;
  __IO uint32_t PR;
  __IO uint32_t RLR;
  __IO uint32_t SR;
} IWDG_TypeDef;

/** 
* @brief Power Control
*/

typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t CSR;
} PWR_TypeDef;

/** 
* @brief Reset and Clock Control
*/

typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t CFGR;
  __IO uint32_t CIR;
  __IO uint32_t APB2RSTR;
  __IO uint32_t APB1RSTR;
  __IO uint32_t AHBENR;
  __IO uint32_t APB2ENR;
  __IO uint32_t APB1ENR;
  __IO uint32_t BDCR;
  __IO uint32_t CSR;
	#ifdef MM32L0xxxx
	__IO uint32_t RESERVED0;
	__IO uint32_t RESERVED1;
	__IO uint32_t RESERVED2;
	__IO uint32_t RESERVED3;
	__IO uint32_t RESERVED4;
	__IO uint32_t RESERVED5;
	__IO uint32_t SYSCFG;
#endif
} RCC_TypeDef;



/** 
* @brief Serial Peripheral Interface
*/


typedef struct
{
  __IO uint32_t TXREG; 
  __IO uint32_t RXREG;
  __IO uint16_t CSTAT;
  uint16_t  RESERVED0;
  __IO uint16_t INTSTAT;
  uint16_t  RESERVED1;
  __IO uint16_t INTEN;
  uint16_t  RESERVED2;
  __IO uint16_t INTCLR;
  uint16_t  RESERVED3;
  __IO uint16_t GCTL;
  uint16_t  RESERVED4;
  __IO uint16_t CCTL;
  uint16_t  RESERVED5;
  __IO uint16_t SPBRG;
  uint16_t  RESERVED6;
  __IO uint16_t RXDNR;
  uint16_t  RESERVED7;
  __IO uint16_t SCSR;
  uint16_t  RESERVED8;
 	__IO uint16_t EXTSCR;
	uint16_t  RESERVED9;
} SPI_TypeDef;


/** 
* @brief TIM
*/

typedef struct
{
  __IO uint32_t CR1;
  __IO uint32_t CR2;
  __IO uint32_t SMCR;
  __IO uint32_t DIER;
  __IO uint32_t SR;
  __IO uint32_t EGR;
  __IO uint32_t CCMR1;
  __IO uint32_t CCMR2;
  __IO uint32_t CCER;
  __IO uint32_t CNT;
  __IO uint32_t PSC;
  __IO uint32_t ARR;
  __IO uint32_t RCR;
  __IO uint32_t CCR1;
  __IO uint32_t CCR2;
  __IO uint32_t CCR3;
  __IO uint32_t CCR4;
  __IO uint32_t BDTR;
  __IO uint32_t DCR;
  __IO uint32_t DMAR;
  __IO uint32_t OR;              /*!< TIM option register,                         Address offset: 0x50 */
} TIM_TypeDef;

/** 
* @brief Universal Synchronous Asynchronous Receiver Transmitter
*/

typedef struct
{
  __IO uint32_t TDR;
  __IO uint32_t RDR;
  __IO uint32_t CSR;
  __IO uint32_t ISR;
  __IO uint32_t IER;
  __IO uint32_t ICR;
  __IO uint32_t GCR;
  __IO uint32_t CCR;
  __IO uint32_t BRR;
	
#ifdef MM32L0xxxx
	__IO uint32_t FRA;
#endif
	
} UART_TypeDef;

/** 
* @brief Window WATCHDOG
*/

typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t CFR;
  __IO uint32_t SR;
} WWDG_TypeDef;

#ifdef MM32L0xxxx
typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t SR;
  __IO uint32_t DINR;
  __IO uint32_t DOUTR;
  __IO uint32_t KEYR0;
  __IO uint32_t KEYR1;
  __IO uint32_t KEYR2;
  __IO uint32_t KEYR3;
  __IO uint32_t IVR0;
  __IO uint32_t IVR1;
  __IO uint32_t IVR2;
  __IO uint32_t IVR3;
	__IO uint32_t KEYR4;
  __IO uint32_t KEYR5;
  __IO uint32_t KEYR6;
  __IO uint32_t KEYR7;
  
} AES_TypeDef;
/** 
* @brief CRS
*/
typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t CFGR;
  __IO uint32_t ISR;
  __IO uint32_t ICR;
  
} CRS_TypeDef;

/** 
* @brief Analog Comparators 
*/

typedef struct
{
  __IO uint32_t CSR;    /*!< Comparator control Status register, Address offset: 0x00 */
} COMP_TypeDef;

/** 
* @brief USB 
*/
typedef struct
{
  __IO uint32_t  rTOP;        		/*!           Address offset: 0x00 */
  __IO uint32_t  rINT_STATE;        	/*!           Address offset: 0x04 */
  __IO uint32_t  rEP_INT_STATE;  		/*!           Address offset: 0x08 */
  __IO uint32_t  rEP0_INT_STATE; 		/*!           Address offset: 0x0C */
  __IO uint32_t  rINT_EN;        		/*!           Address offset: 0x10 */
  __IO uint32_t  rEP_INT_EN;        	/*!           Address offset: 0x14 */	
  __IO uint32_t  rEP0_INT_EN;      	/*!           Address offset: 0x18 */
  
  __IO uint32_t  RESERVED0; 	
  
  //__IO uint32_t  rEP1_4_INT_STATE[4];      /*!           Address offset: 0x20 */	
  
  __IO uint32_t  rEP1_INT_STATE;      /*!           Address offset: 0x20 */
  __IO uint32_t  rEP2_INT_STATE;      /*!           Address offset: 0x24 */	
  __IO uint32_t  rEP3_INT_STATE;      /*!           Address offset: 0x28 */
  __IO uint32_t  rEP4_INT_STATE;      /*!           Address offset: 0x2C */
  
  __IO uint32_t  RESERVED1; 			/*!           Address offset: 0x30 */
  __IO uint32_t  RESERVED2; 			/*!           Address offset: 0x34 */
  __IO uint32_t  RESERVED3; 			/*!           Address offset: 0x38 */
  __IO uint32_t  RESERVED4; 			/*!           Address offset: 0x3C */
  
  __IO uint32_t  rEP1_INT_EN;        	/*!           Address offset: 0x40 */	
  __IO uint32_t  rEP2_INT_EN;        	/*!           Address offset: 0x44 */
  __IO uint32_t  rEP3_INT_EN;        	/*!           Address offset: 0x48 */
  __IO uint32_t  rEP4_INT_EN;        	/*!           Address offset: 0x4C */	
  
  __IO uint32_t  RESERVED5; 			/*!           Address offset: 0x50 */
  __IO uint32_t  RESERVED6; 			/*!           Address offset: 0x54 */
  __IO uint32_t  RESERVED7; 			/*!           Address offset: 0x58 */
  __IO uint32_t  RESERVED8; 			/*!           Address offset: 0x5C */
  
  __IO uint32_t  rADDR;        		/*!           Address offset: 0x60 */
  __IO uint32_t  rEP_EN;        		/*!           Address offset: 0x64 */
  
  __IO uint32_t  RESERVED9; 			/*!           Address offset: 0x68 */
  __IO uint32_t  RESERVED10; 			/*!           Address offset: 0x6C */
  __IO uint32_t  RESERVED11; 			/*!           Address offset: 0x70 */
  __IO uint32_t  RESERVED12; 			/*!           Address offset: 0x74 */
  
  __IO uint32_t  rTOG_CTRL1_4;        /*!           Address offset: 0x78 */
  
  __IO uint32_t  RESERVED13; 			/*!           Address offset: 0x7C */
  
  __IO uint32_t  rSETUP[8];        		/*!           Address offset: 0x80 */
  //__IO uint32_t  rSETUP0;        		/*!           Address offset: 0x80 */
  //__IO uint32_t  rSETUP1;        		/*!           Address offset: 0x84 */
  //__IO uint32_t  rSETUP2;        		/*!           Address offset: 0x88 */		
  //__IO uint32_t  rSETUP3;        		/*!           Address offset: 0x8C */
  //__IO uint32_t  rSETUP4;        		/*!           Address offset: 0x90 */
  //__IO uint32_t  rSETUP5;        		/*!           Address offset: 0x94 */		
  //__IO uint32_t  rSETUP6;        		/*!           Address offset: 0x98 */
  //__IO uint32_t  rSETUP7;        		/*!           Address offset: 0x9C */
  __IO uint32_t  rPAKET_SIZE0;    	/*!           Address offset: 0xA0 */	
  __IO uint32_t  rPAKET_SIZE1;    	/*!           Address offset: 0xA4 */	
  
  __IO uint32_t  RESERVED14; 			/*!           Address offset: 0xA8 */
  __IO uint32_t  RESERVED15; 			/*!           Address offset: 0xAC */
  
