LiteOS/LiteOS/platform/MM32L073PF/include/MM32L073PF.h
///*******************  Bit definition for EP3_INT_STATE register  *******************/
//#define  EP3_INT_STATE_END                    ((uint16_t)0x0002) 
//#define  EP3_INT_STATE_INNACK                 ((uint16_t)0x0004) 
//#define  EP3_INT_STATE_INACK                  ((uint16_t)0x0008) 
//#define  EP3_INT_STATE_INSTALL                ((uint16_t)0x0010) 
//#define  EP3_INT_STATE_OUTNACK                ((uint16_t)0x0020) 
//#define  EP3_INT_STATE_OUTACK                 ((uint16_t)0x0040) 
//#define  EP3_INT_STATE_OUTSTALL               ((uint16_t)0x0080) 

///*******************  Bit definition for EP4_INT_STATE register  *******************/
//#define  EP4_INT_STATE_END                    ((uint16_t)0x0002) 
//#define  EP4_INT_STATE_INNACK                 ((uint16_t)0x0004) 
//#define  EP4_INT_STATE_INACK                  ((uint16_t)0x0008) 
//#define  EP4_INT_STATE_INSTALL                ((uint16_t)0x0010) 
//#define  EP4_INT_STATE_OUTNACK                ((uint16_t)0x0020) 
//#define  EP4_INT_STATE_OUTACK                 ((uint16_t)0x0040) 
//#define  EP4_INT_STATE_OUTSTALL               ((uint16_t)0x0080) 

///*******************  Bit definition for EP1_INT_EN register  *******************/
//#define  EPn_INT_EN_ENDIE                     ((uint16_t)0x0002) 
//#define  EPn_INT_EN_INNACKIE                  ((uint16_t)0x0004) 
//#define  EPn_INT_EN_INACKIE                   ((uint16_t)0x0008) 
//#define  EPn_INT_EN_INSTALLIE                 ((uint16_t)0x0010) 
//#define  EPn_INT_EN_OUTNACKIE                 ((uint16_t)0x0020) 
//#define  EPn_INT_EN_OUTACKIE                  ((uint16_t)0x0040) 
//#define  EPn_INT_EN_OUTSTALLIE                ((uint16_t)0x0080) 

/*******************  Bit definition for USB_ADDR register  *******************/
#define  USB_ADDR_ADDR                        ((uint16_t)0x007F) 

/*******************  Bit definition for EP_EN register  *******************/
#define  EP_EN_EP0EN                        ((uint16_t)0x0001) 
#define  EP_EN_EP1EN                        ((uint16_t)0x0002) 
#define  EP_EN_EP2EN                        ((uint16_t)0x0004) 
#define  EP_EN_EP3EN                        ((uint16_t)0x0008) 
#define  EP_EN_EP4EN                        ((uint16_t)0x0010) 

/*******************  Bit definition for TOG_CTRL1_4 register  *******************/
#define  TOG_CTRL1_4_DTOG1                  ((uint16_t)0x0001) 
#define  TOG_CTRL1_4_DTOG1EN                ((uint16_t)0x0002) 
#define  TOG_CTRL1_4_DTOG2                  ((uint16_t)0x0004) 
#define  TOG_CTRL1_4_DTOG2EN                ((uint16_t)0x0008) 
#define  TOG_CTRL1_4_DTOG3                  ((uint16_t)0x0010) 
#define  TOG_CTRL1_4_DTOG3EN                ((uint16_t)0x0020) 
#define  TOG_CTRL1_4_DTOG4                  ((uint16_t)0x0040) 
#define  TOG_CTRL1_4_DTOG4EN                ((uint16_t)0x0080) 

/*******************  Bit definition for SETUP0 register  *******************/
#define  SETUP0                             ((uint16_t)0x00FF) 

/*******************  Bit definition for SETUP1 register  *******************/
#define  SETUP1                             ((uint16_t)0x00FF) 

/*******************  Bit definition for SETUP2 register  *******************/
#define  SETUP2                             ((uint16_t)0x00FF) 

/*******************  Bit definition for SETUP3 register  *******************/
#define  SETUP3                             ((uint16_t)0x00FF) 

/*******************  Bit definition for SETUP4 register  *******************/
#define  SETUP4                             ((uint16_t)0x00FF) 

/*******************  Bit definition for SETUP5 register  *******************/
#define  SETUP5                             ((uint16_t)0x00FF) 

/*******************  Bit definition for SETUP6 register  *******************/
#define  SETUP6                             ((uint16_t)0x00FF) 

/*******************  Bit definition for SETUP7 register  *******************/
#define  SETUP7                             ((uint16_t)0x00FF) 

/*******************  Bit definition for PACKET_SIZE1 register  *******************/
#define  PACKET_SIZE1                        ((uint16_t)0x00FF) 

/*******************  Bit definition for PACKET_SIZE2 register  *******************/
#define  PACKET_SIZE2                        ((uint16_t)0x00FF) 

/*******************  Bit definition for EP0_AVIL register  *******************/
#define  EP0_AVIL_EPXAVIL                   ((uint16_t)0x00FF) 

/*******************  Bit definition for EP1_AVIL register  *******************/
#define  EP1_AVIL_EPXAVIL                   ((uint16_t)0x00FF) 

/*******************  Bit definition for EP2_AVIL register  *******************/
#define  EP2_AVIL_EPXAVIL                   ((uint16_t)0x00FF) 

/*******************  Bit definition for EP3_AVIL register  *******************/
#define  EP3_AVIL_EPXAVIL                   ((uint16_t)0x00FF) 

/*******************  Bit definition for EP4_AVIL register  *******************/
#define  EP4_AVIL_EPXAVIL                   ((uint16_t)0x00FF) 

/*******************  Bit definition for EP0_CTRL register  *******************/
#define  EP0_CTRL_TRANEN                    ((uint16_t)0x0080) 

#define  EP0_CTRL_TRANCOUNT                 ((uint16_t)0x007F) 
#define  EP0_CTRL_TRANCOUNT_0               ((uint16_t)0x0001) 
#define  EP0_CTRL_TRANCOUNT_1               ((uint16_t)0x0002) 
#define  EP0_CTRL_TRANCOUNT_2               ((uint16_t)0x0004) 
#define  EP0_CTRL_TRANCOUNT_3               ((uint16_t)0x0008) 
#define  EP0_CTRL_TRANCOUNT_4               ((uint16_t)0x0010) 
#define  EP0_CTRL_TRANCOUNT_5               ((uint16_t)0x0020) 
#define  EP0_CTRL_TRANCOUNT_6               ((uint16_t)0x0040) 

/*******************  Bit definition for EP1_CTRL register  *******************/
#define  EP1_CTRL_TRANEN                    ((uint16_t)0x0080) 

#define  EP1_CTRL_TRANCOUNT                 ((uint16_t)0x007F) 
#define  EP1_CTRL_TRANCOUNT_0               ((uint16_t)0x0001) 
#define  EP1_CTRL_TRANCOUNT_1               ((uint16_t)0x0002) 
#define  EP1_CTRL_TRANCOUNT_2               ((uint16_t)0x0004) 
#define  EP1_CTRL_TRANCOUNT_3               ((uint16_t)0x0008) 
#define  EP1_CTRL_TRANCOUNT_4               ((uint16_t)0x0010) 
#define  EP1_CTRL_TRANCOUNT_5               ((uint16_t)0x0020) 
#define  EP1_CTRL_TRANCOUNT_6               ((uint16_t)0x0040) 

/*******************  Bit definition for EP2_CTRL register  *******************/
#define  EP2_CTRL_TRANEN                    ((uint16_t)0x0080) 

#define  EP2_CTRL_TRANCOUNT                 ((uint16_t)0x007F) 
#define  EP2_CTRL_TRANCOUNT_0               ((uint16_t)0x0001) 
#define  EP2_CTRL_TRANCOUNT_1               ((uint16_t)0x0002) 
#define  EP2_CTRL_TRANCOUNT_2               ((uint16_t)0x0004) 
#define  EP2_CTRL_TRANCOUNT_3               ((uint16_t)0x0008) 
#define  EP2_CTRL_TRANCOUNT_4               ((uint16_t)0x0010) 
#define  EP2_CTRL_TRANCOUNT_5               ((uint16_t)0x0020) 
#define  EP2_CTRL_TRANCOUNT_6               ((uint16_t)0x0040) 

/*******************  Bit definition for EP3_CTRL register  *******************/
#define  EP3_CTRL_TRANEN                    ((uint16_t)0x0080) 

#define  EP3_CTRL_TRANCOUNT                 ((uint16_t)0x007F) 
#define  EP3_CTRL_TRANCOUNT_0               ((uint16_t)0x0001) 
#define  EP3_CTRL_TRANCOUNT_1               ((uint16_t)0x0002) 
#define  EP3_CTRL_TRANCOUNT_2               ((uint16_t)0x0004) 
#define  EP3_CTRL_TRANCOUNT_3               ((uint16_t)0x0008) 
#define  EP3_CTRL_TRANCOUNT_4               ((uint16_t)0x0010) 
#define  EP3_CTRL_TRANCOUNT_5               ((uint16_t)0x0020) 
#define  EP3_CTRL_TRANCOUNT_6               ((uint16_t)0x0040) 

/*******************  Bit definition for EP4_CTRL register  *******************/
#define  EP4_CTRL_TRANEN                    ((uint16_t)0x0080) 

