LiteOS/LiteOS/platform/MM32L073PF/include/MM32L073PF.h
/*******************  Bit definition for CAN_IER register  *******************/
#define  CAN_IER_RIE							 ((uint16_t)0x0001)
#define  CAN_IER_TIE							 ((uint16_t)0x0002)
#define  CAN_IER_EIE							 ((uint16_t)0x0004)
#define  CAN_IER_DOIE							 ((uint16_t)0x0008)
#define  CAN_IER_WUIE							 ((uint16_t)0x0010)
#define  CAN_IER_EPIE							 ((uint16_t)0x0020)
#define  CAN_IER_ALIE							 ((uint16_t)0x0040)
#define  CAN_IER_BEIE							 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_ALC register  *******************/
#define  CAN_ALC_BITNO							 ((uint16_t)0x001F)
#define  CAN_ALC_BITNO_0						 ((uint16_t)0x0001)
#define  CAN_ALC_BITNO_1						 ((uint16_t)0x0002)
#define  CAN_ALC_BITNO_2						 ((uint16_t)0x0004)
#define  CAN_ALC_BITNO_3						 ((uint16_t)0x0008)
#define  CAN_ALC_BITNO_4						 ((uint16_t)0x0010)

/*******************  Bit definition for CAN_ECC register  *******************/
#define  CAN_ECC_DIR							 ((uint16_t)0x0020)

#define  CAN_ECC_SEG							 ((uint16_t)0x001F)
#define  CAN_ECC_SEG_0							 ((uint16_t)0x0001)
#define  CAN_ECC_SEG_1							 ((uint16_t)0x0002)
#define  CAN_ECC_SEG_2							 ((uint16_t)0x0004)
#define  CAN_ECC_SEG_3							 ((uint16_t)0x0008)
#define  CAN_ECC_SEG_4							 ((uint16_t)0x0010)

#define  CAN_ECC_ERRC							 ((uint16_t)0x00C0)
#define  CAN_ECC_ERRC_0							 ((uint16_t)0x0040)
#define  CAN_ECC_ERRC_1							 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_EWLR register  *******************/
#define  CAN_EWLR_EWL							 ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_RXERR register  *******************/
#define  CAN_RXERR_RXERR						 ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_TXERR register  *******************/
#define  CAN_TXERR_TXERR						 ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_FF register  *******************/
#define  CAN_FF_RTR						         ((uint16_t)0x0040)
#define  CAN_FF_FF						         ((uint16_t)0x0080)

#define  CAN_FF_DLC						         ((uint16_t)0x000F)
#define  CAN_FF_DLC_0						     ((uint16_t)0x0001)
#define  CAN_FF_DLC_1						     ((uint16_t)0x0002)
#define  CAN_FF_DLC_2						     ((uint16_t)0x0004)
#define  CAN_FF_DLC_3						     ((uint16_t)0x0008)

/*******************  Bit definition for CAN_ACR0 register  *******************/
#define  CAN_ACR0_AC                          ((uint16_t)0x00FF)     
#define  CAN_ACR0_AC_0                        ((uint16_t)0x0001)   
#define  CAN_ACR0_AC_1                        ((uint16_t)0x0002) 
#define  CAN_ACR0_AC_2                        ((uint16_t)0x0004)  
#define  CAN_ACR0_AC_3                        ((uint16_t)0x0008)  
#define  CAN_ACR0_AC_4                        ((uint16_t)0x0010)  
#define  CAN_ACR0_AC_5                        ((uint16_t)0x0020)  
#define  CAN_ACR0_AC_6                        ((uint16_t)0x0040) 
#define  CAN_ACR0_AC_7                        ((uint16_t)0x0080)    

/*******************  Bit definition for CAN_ACR1 register  *******************/
#define  CAN_ACR1_AC                          ((uint16_t)0x00FF)     
#define  CAN_ACR1_AC_0                        ((uint16_t)0x0001)   
#define  CAN_ACR1_AC_1                        ((uint16_t)0x0002) 
#define  CAN_ACR1_AC_2                        ((uint16_t)0x0004)  
#define  CAN_ACR1_AC_3                        ((uint16_t)0x0008)  
#define  CAN_ACR1_AC_4                        ((uint16_t)0x0010)  
#define  CAN_ACR1_AC_5                        ((uint16_t)0x0020)  
#define  CAN_ACR1_AC_6                        ((uint16_t)0x0040) 
#define  CAN_ACR1_AC_7                        ((uint16_t)0x0080)   

/*******************  Bit definition for CAN_ACR2 register  *******************/
#define  CAN_ACR2_AC                          ((uint16_t)0x00FF)     
#define  CAN_ACR2_AC_0                        ((uint16_t)0x0001)   
#define  CAN_ACR2_AC_1                        ((uint16_t)0x0002) 
#define  CAN_ACR2_AC_2                        ((uint16_t)0x0004)  
#define  CAN_ACR2_AC_3                        ((uint16_t)0x0008)  
#define  CAN_ACR2_AC_4                        ((uint16_t)0x0010)  
#define  CAN_ACR2_AC_5                        ((uint16_t)0x0020)  
#define  CAN_ACR2_AC_6                        ((uint16_t)0x0040) 
#define  CAN_ACR2_AC_7                        ((uint16_t)0x0080)   

/*******************  Bit definition for CAN_ACR3 register  *******************/
#define  CAN_ACR3_AC                          ((uint16_t)0x00FF)     
#define  CAN_ACR3_AC_0                        ((uint16_t)0x0001)   
#define  CAN_ACR3_AC_1                        ((uint16_t)0x0002) 
#define  CAN_ACR3_AC_2                        ((uint16_t)0x0004)  
#define  CAN_ACR3_AC_3                        ((uint16_t)0x0008)  
#define  CAN_ACR3_AC_4                        ((uint16_t)0x0010)  
#define  CAN_ACR3_AC_5                        ((uint16_t)0x0020)  
#define  CAN_ACR3_AC_6                        ((uint16_t)0x0040) 
#define  CAN_ACR3_AC_7                        ((uint16_t)0x0080)   

/*******************  Bit definition for CAN_AMR0 register  *******************/
#define  CAN_AMR0_AM                          ((uint16_t)0x00FF)     
#define  CAN_AMR0_AM_0                        ((uint16_t)0x0001)   
#define  CAN_AMR0_AM_1                        ((uint16_t)0x0002) 
#define  CAN_AMR0_AM_2                        ((uint16_t)0x0004)  
#define  CAN_AMR0_AM_3                        ((uint16_t)0x0008) 
#define  CAN_AMR0_AM_4                        ((uint16_t)0x0010)  
#define  CAN_AMR0_AM_5                        ((uint16_t)0x0020)  
#define  CAN_AMR0_AM_6                        ((uint16_t)0x0040) 
#define  CAN_AMR0_AM_7                        ((uint16_t)0x0080)  

/*******************  Bit definition for CAN_AMR1 register  *******************/
#define  CAN_AMR1_AM                          ((uint16_t)0x00FF)     
#define  CAN_AMR1_AM_0                        ((uint16_t)0x0001)   
#define  CAN_AMR1_AM_1                        ((uint16_t)0x0002) 
#define  CAN_AMR1_AM_2                        ((uint16_t)0x0004)  
#define  CAN_AMR1_AM_3                        ((uint16_t)0x0008) 
#define  CAN_AMR1_AM_4                        ((uint16_t)0x0010)  
#define  CAN_AMR1_AM_5                        ((uint16_t)0x0020)  
#define  CAN_AMR1_AM_6                        ((uint16_t)0x0040) 
#define  CAN_AMR1_AM_7                        ((uint16_t)0x0080) 

/*******************  Bit definition for CAN_AMR2 register  *******************/
#define  CAN_AMR2_AM                          ((uint16_t)0x00FF)     
#define  CAN_AMR2_AM_0                        ((uint16_t)0x0001)   
#define  CAN_AMR2_AM_1                        ((uint16_t)0x0002) 
#define  CAN_AMR2_AM_2                        ((uint16_t)0x0004)  
#define  CAN_AMR2_AM_3                        ((uint16_t)0x0008) 
#define  CAN_AMR2_AM_4                        ((uint16_t)0x0010)  
#define  CAN_AMR2_AM_5                        ((uint16_t)0x0020)  
#define  CAN_AMR2_AM_6                        ((uint16_t)0x0040) 
#define  CAN_AMR2_AM_7                        ((uint16_t)0x0080) 

/*******************  Bit definition for CAN_AMR3 register  *******************/
#define  CAN_AMR3_AM                          ((uint16_t)0x00FF)     
#define  CAN_AMR3_AM_0                        ((uint16_t)0x0001)   
#define  CAN_AMR3_AM_1                        ((uint16_t)0x0002) 
#define  CAN_AMR3_AM_2                        ((uint16_t)0x0004)  
#define  CAN_AMR3_AM_3                        ((uint16_t)0x0008) 
#define  CAN_AMR3_AM_4                        ((uint16_t)0x0010)  
#define  CAN_AMR3_AM_5                        ((uint16_t)0x0020)  
#define  CAN_AMR3_AM_6                        ((uint16_t)0x0040) 
#define  CAN_AMR3_AM_7                        ((uint16_t)0x0080) 

/*******************  Bit definition for CAN_RMC register  *******************/
#define  CAN_RMC_RMC                          ((uint16_t)0x001F) 

/*******************  Bit definition for CAN_RBSA register  *******************/
#define  CAN_RBSA_RBSA                        ((uint16_t)0x003F)     

/**
* @}
*/

/**
* @}
*/ 

#ifdef USE_STDPERIPH_DRIVER
#include "HAL_conf.h"
#endif

/** @addtogroup Exported_macro
* @{
*/

#define SET_BIT(REG, BIT)     ((REG) |= (BIT))

#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))

#define READ_BIT(REG, BIT)    ((REG) & (BIT))

#define CLEAR_REG(REG)        ((REG) = (0x0))

#define WRITE_REG(REG, VAL)   ((REG) = (VAL))

#define READ_REG(REG)         ((REG))

#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~CLEARMASK)) | (SETMASK)))



/* Exported macro ------------------------------------------------------------*/
#ifdef  USE_FULL_ASSERT

/**
* @brief  The assert_param macro is used for function's parameters check.
* @param expr: If expr is false, it calls assert_failed function
*   which reports the name of the source file and the source
*   line number of the call that failed. 
*   If expr is true, it returns no value.
* @retval : None
*/
#define assert_param(expr) ((expr) ? (void)0 : assert_failed((uint8_t *)__FILE__, __LINE__))
/* Exported functions ------------------------------------------------------- */
void assert_failed(uint8_t* file, uint32_t line);
#else
#define assert_param(expr) ((void)0)
#endif /* USE_FULL_ASSERT */


/**
* @}
*/

#endif /* __MM32L0xx_H */

/**
* @}
*/

/**
* @}
*/

/*-------------------------(C) COPYRIGHT 2017 MindMotion ----------------------*/
